{"meta":{"title":"Blog","subtitle":"","description":"","author":"MJ","url":"https://jarvie-mei.github.io","root":"/"},"pages":[{"title":"","date":"2020-12-31T17:07:18.127Z","comments":true,"path":"hexo-admin-ehc-images.json","permalink":"https://jarvie-mei.github.io/hexo-admin-ehc-images.json","excerpt":"","text":"[{\"name\":\"DASHENG-900x700-1.png\",\"date\":1518959551960},{\"name\":\"DASHENG-900x700-2.png\",\"date\":1518959599098},{\"name\":\"DASHENG-900x700-3.png\",\"date\":1518959609913},{\"name\":\"DASHENG-900x700-4.png\",\"date\":1518959618105}]"},{"title":"404 Not Found：该页无法显示","date":"2020-12-31T17:07:18.127Z","comments":false,"path":"/404.html","permalink":"https://jarvie-mei.github.io/404.html","excerpt":"","text":""},{"title":"关于","date":"2020-12-31T17:07:18.127Z","comments":false,"path":"about/index.html","permalink":"https://jarvie-mei.github.io/about/index.html","excerpt":"","text":"个人详细介绍"},{"title":"分类","date":"2020-12-31T17:07:18.127Z","comments":false,"path":"categories/index.html","permalink":"https://jarvie-mei.github.io/categories/index.html","excerpt":"","text":""},{"title":"友情链接","date":"2020-12-31T17:07:18.131Z","comments":true,"path":"links/index.html","permalink":"https://jarvie-mei.github.io/links/index.html","excerpt":"","text":""},{"title":"Repositories","date":"2020-12-31T17:07:18.131Z","comments":false,"path":"repository/index.html","permalink":"https://jarvie-mei.github.io/repository/index.html","excerpt":"","text":""},{"title":"标签","date":"2020-12-31T17:07:18.131Z","comments":false,"path":"tags/index.html","permalink":"https://jarvie-mei.github.io/tags/index.html","excerpt":"","text":""}],"posts":[{"title":"算法竞赛学习笔记","slug":"competitive programing","date":"2020-12-29T07:01:51.000Z","updated":"2020-12-31T07:05:07.000Z","comments":true,"path":"2020/12/29/competitive programing/","link":"","permalink":"https://jarvie-mei.github.io/2020/12/29/competitive%20programing/","excerpt":"","text":"算法竞赛 《算法竞赛入门指南》 第三章 数组和字符串 scanf(&quot;%s&quot;) 输入字符串，碰到空格或者TAB就会停下来。虽然下次调用时会输入下一个字符串，可是不知道两次输入的字符串中间有多少个空格、TAB甚至换行符。可以用下述两种方法解决这个问题： 使用 fgetc(fin), 它读取一个打开的文件fin ， 读取一个字符， 然后返回一个int 值。从标准输入中读取一个字符，可以用getchar(),它等价于 fgetc(stdin)。 使用fgets(buf,maxn,fin) 读取完整的一行，其中buf的声明为char buf[maxn]。 这个函数一旦读取到’\\n’就会停止。 123456789#include &lt;stdio.h&gt;int main () &#123; int c, q = 1; while((c = getchar()) != EOF) &#123; if(c == &#x27;&quot;&#x27;) &#123;printf(&quot;%s&quot;, q ? &quot;``&quot;: &quot;&#x27;&#x27;&quot;); q = !q;&#125; else printf(&quot;%c&quot;, c); &#125; return 0;&#125; 一个数组分成两半的循环： 1for (int i = 0; i &lt; (len+1)/2; i++) 例题 3-4 猜数字游戏的提示 source：uva340 实现一个经典”猜数字游戏“。给定答案序列和用户猜的序列，统计有多少数字位置正确（A），有多少数字在两个序列中都出现过但是位置不对（B）。 In this problem you will be given a secret code s1 . . . sn and a guess g1 . . . gn, and are to determine the hint. A hint consists of a pair of numbers determined as follows. A match is a pair (i, j), 1 ≤ i ≤ n and 1 ≤ j ≤ n, such that si = gj . Match (i, j) is called strong when i = j, and is called weak otherwise. Two matches (i, j) and (p, q) are called independent when i = p if and only if j = q. A set of matches is called independent when all of its members are pairwise independent. Designer chooses an independent set M of matches for which the total number of matches and the number of strong matches are both maximal. The hint then consists of the number of strong followed by the number of weak matches in M. Note that these numbers are uniquely determined by the secret code and the guess. If the hint turns out to be (n, 0), then the guess is identical to the secret code. the english version of description is better for me to understand the topic : ) 1234567891011121314151617181920212223242526272829Sample Input41 3 5 51 1 2 34 3 3 56 5 5 16 1 3 51 3 5 50 0 0 0101 2 2 2 4 5 6 6 6 91 2 3 4 5 6 7 8 9 11 1 2 2 3 3 4 4 5 51 2 1 3 1 5 1 6 1 91 2 2 5 5 5 6 6 6 70 0 0 0 0 0 0 0 0 00Sample OutputGame 1:(1,1)(2,0)(1,2)(1,2)(4,0)Game 2:(2,4)(3,2)(5,0)(7,0) 12345678910111213141516171819202122232425262728293031323334353637383940#include &lt;stdio.h&gt;#define maxn 1010int main() &#123; int n, a[maxn], b[maxn]; int kase = 0; // 开始有输入 while ( scanf(&quot;%d&quot;, &amp;n) == 1 &amp; n ) &#123; printf(&quot;Game %d:\\n&quot;, ++kase); // 答案序列 for (int i = 0; i &lt; n; i++) scanf(&quot;%d&quot;, &amp;a[i]); // 循环输入猜测序列 for (;;) &#123; // 用A和B对每一次的猜测做统计 int A = 0, B = 0; for( int i = 0; i &lt; n; i++ ) &#123; scanf(&quot;%d&quot;, &amp;b[i]); // 将位置正确的数字个数先统计 if ( a[i] == b[i] ) A++; &#125; if(b[0] == 0) break; // 统计每一次猜测中，有多少的数字在两个序列中都出现过， // 循环数字1-9，分别统计 for ( int d = 1; d &lt;= 9; d++ ) &#123; int c1 = 0, c2 = 0; for ( int i = 0; i &lt; n; i++ ) &#123; if (a[i] == d) c1++; if (b[i] == d) c2++; &#125; // 如果数字在两个序列中都出现了，为了保证匹配集独立 // 匹配数 = min(c1,c2) if (c1 &lt; c2) B+=c1; else B+=c2; &#125; printf(&quot; (%d,%d)\\n&quot;, A, B-A); &#125; &#125; return 0;&#125; 例题 3-6 环状序列 题目描述： uva1584 12345678910111213141516171819202122232425262728293031323334#include &lt;stdio.h&gt;#include &lt;string.h&gt;#define maxn 105//给定一个环串s，判断分别从位置p与位置q作为起始位置，哪个字典序更小//函数以 0 1 作为返回值，方便做条件判断int less(char* s, int p, int q) &#123; //逐一对比各个字符的字典序大小 int n = strlen(s); for( int i = 0; i &lt; n; i++ ) if( s[(p+i) % n] != s[(q+i) % n]) return s[(p+i) % n] &lt; s[(q+i) % n]; return 0;//相等，则返回 0 与 1 都可以。&#125;int main() &#123; int T; scanf(&quot;%d&quot;, &amp;T); //定义一个字符数组存放待输入的字符串 char s[maxn]; int n;//计算s的长度 while(T--) &#123; scanf(&quot;%s&quot;, s); n = strlen(s); int ans = 0;//ans标记最小字典序的起始位置 //比较另外n-1个位置，找出最小字典序 for(int i = 1; i &lt; n; i++) if(less(s,i,ans)) ans = i; for(int i = 0; i &lt; n; i++) putchar(s[(ans+i) % n]); putchar(&#x27;\\n&#x27;); &#125; return 0;&#125;","categories":[],"tags":[]},{"title":"考研英语一作文预测","slug":"English essays","date":"2020-12-15T14:15:41.000Z","updated":"2020-12-21T07:09:22.000Z","comments":true,"path":"2020/12/15/English essays/","link":"","permalink":"https://jarvie-mei.github.io/2020/12/15/English%20essays/","excerpt":"","text":"小作文 感谢信 Directions: After being involved in an accident, you were looked after by Mr. Shakespeare. Write a special letter to express your thanks. Dear Mr. Shakespeare, \\qquadI am writing to express my heartfelt gratitude. I am referring to that unfortunate accident the other day , when I was knocked off my bike by a taxi. \\qquadIf it had not been for your timely assistance in giving me first aid, I fear that the consequences might have been much more serious. Everyone agrees that it was your quick-witted response[机智反应] in that emergency that gave rise to this satisfactory outcome. \\qquad Although nowadays people in mounting numbers talk about the need to be unselfish, we see very few people practice what they preach [鼓吹]. If there were more people like you, this world would be a much nice place. 邀请信 Directions: Write an email to invite a famous professor to give a lecture to the students who love English in your university. Dear Professor Alexander, \\qquadOn behalf of all the students at my university who share a love for the English language, I cordially invite you to give a lecture at Beijing Foreign Studies University. \\qquadAs you are one of the leading experts in the English language study all over the world, I believe that the students will not only be able to learn from you, but to be inspired by you as well. We are hoping that you will be available for a lecture on our campus on January 4th, at 10:00 am. There will be 45 minutes allocated for your lecture and 15 minutes for a question and answer session. \\qquadIf you have an questions about coming to our university for the lecture, please let me know. We are looking forward to your reply. 投诉信 Directions: You have recently returned from a trip. However, you were dissatisfied with the service you received at the hotel. Write a letter to the manager of the hotel. Give details of what you have experienced, and explain why you were unhappy with the service and give suggestions for improving the service. Dear sir or Madam, \\qquadI write to express my dissatisfaction with the service I received while staying at your hotel during my vacation between the 2nd and 11th of April this year. \\qquadAlthough your hotel is rated as five-star one, I found that the rooms were not cleaned on a daily basis, and that my bed was cleaned up only every three days. In addition, the food in the restaurant was similarly disappointing. Not only was it extremely overpriced, but the quality was very poor. I was therefore forced to eat out in the local restaurants. \\qquadI trust you will take my complaints seriously, and make every effort to improve your service in the near future. I would greatly appreciate a discount on my bill (receipt enclosed) . I look forward to a favorable reply at your earliest convenience. 建议信 Directions: You are studying at university and one of your professors has asked his students to write and suggest ways in which he could improve his teaching. Write an email to the professor. Say the way you enjoy about his lectures and suggest how they could be improved. Dear Professor Byron, \\qquadLast week you asked students to write and give you feedback on your lectures. Therefore, I have outlined my thoughts below. \\qquadIn general, I find your lectures very informative and inspiring. Indeed, I particularly like the way you demonstrate complex issues with the use of simple drawings. This makes your lessons both interesting and memorable. However, I do feel that you could provide us with more handouts, for I often fail to take down all the important points as time is limited. I would also like to see more discussion work, as I find this method the most suitable way to clarify and deepen my understanding of the subject content. \\qquadI’d like to thank you for the interest you are taking in us students and look forward to your next lecture. 致编辑信 Directions: Write an email to the editor of your local newspaper, stating your opinion on the issue of thrift. Dear editors, \\qquadMany college students have no concept of thrift in their mind. They take it for granted that they spend the money provided by their parents before they enter society. \\qquadThis extravagant spending is primarily caused by the following factors. First of all, nowadays most of the students are born in only-child families. They are the apple in their family’s eyes and naturally get more care and pocket money. In addition, with the improvement of living standards, parents can afford higher expenditures for their children. \\qquadFrom my point of view, a college student, as a pure consumer, should learn to be thrifty. We should limit our expenditure on daily necessities and not buy whatever we want regardless of their prices. The habit of being thrifty can help us form right values and is favorable to our future development. 介绍信 Directions: Write an email to a group of international students, and introduce one of the most famous Chinese celebrities. Dear Friends, \\qquadI am writing the email to introduce one of the ost prestigious Chinese celebrities to you, Confucius. \\qquadBeing a great thinker, educator and founder of Confucianism, Confucius is an ancient sage during the Spring and Autumn Period. His words and life story were recorded by his disciples and their students in The Analects[论语]. As an enduring classic of Chinese culture, The Analects has influenced all thinkers, writers and politicians in the over-2,000-year-long history of China since Confucius. No scholar could truly understand this long-standing culture or the inner world of the ancient Chinese without this book. \\qquadMuch of Cofucian thought on Heaven an Man represents universal human values. This is perhaps why confucian thought in the 21st century still remains the interest of not only the Chinese people but also people in other parts of the world. 祝贺信 Directions: Write an email to one of your friends, Zhang Wuji, to congratulate him on graduation. Dear Wuji, \\qquadCongratulations upon having received your doctorate in philosophy from Yale University. I know this has meant years of study and hard work on your part, and it is an achievement you can well be proud of. \\qquadI have followed your progress with pleasure and interest for many years. I am sure, from the fine record you have made, that you will be a success in whatever you undertake. No doubt you are tired after the strain of the past few months, and if you would like to come to my hometown for a few weeks this summer, we’d be very happy to have you. \\qquadI’d certainly enjoy hearing about your plans, now that you have completed your college course. Think it over, and let me know. 询问信 Directions: Write a letter to a travel agency, asking about the detailed information of package tour. Dear Sir or Madam, \\qquadI write for information about the package tour to France between July and August this year. \\qquadI would like to receive more information about the tour, including the length and cost. I would also like to know if customers are given a choice of hotels, or if you use standard accommodation. Also, dose the cost include travel insurance , or do I have to arrange this separately? \\qquadAt the same time, would you kindly forward the details of other tours you offer? In fact, I would be particularly intersted in any destination that has ancient monuments[历史遗迹] because archaeology is my specialised subject at university. I look forward to receiving the information at your earliest convenience . 道歉信 Directions: Suppose you have an important interview, but have unfortunately fallen ill. Write an email to apologize. To Whom It May Concern, \\qquadI would like to thank you for arranging meet with me for an interview on Monday, November 6th, 2017, at 10:00 am. \\qquadUnfortunately, I have recently been diagnosed with a serious ear infection which will require surgery on the same day as our interview. I am sorry to say that I will therefore not be able to make the interview and apologize for any inconvenience this may cause you. If possible, I would like to postpone the interview to another day later in the week. I promise that such a thing does not usually happen. \\qquadI am looking forward to hearing from you and, again, am sorry for any trouble this may have caused you. Please kindly excused me for not being able to inform you of my situation sooner. 告示 Directions: Write a notice in the name of the Students’ Union, announcing the foundation of a club. \\qquadThe Students’ Union has recently agreed to set up an English club, to raise students’ English level and to prepare for National English Speech Contest. \\qquadDuring the summer, there will be a large number of English lectures and conferences, and Professor He Qixin, the writer of New Concept English and a world famous English expert, has agreed to give us training. Anyone in the school may join the club by filling in the application form and providing two passport-size photographs by the end of the month. \\qquadThe inaugural[成立的，就职的]meeting will be held in the Students’ Recreational Center at 3pm Saturday, September 10, 2020. 大作文 社会热点类：职业道德 \\qquadThe past several years have witnessed a phenomenon that \\qquad have been arising frrom all walks of life. Regretfully, quite a lot of \\qquad, just as\\qquadin the given cartoon. \\qquadIronically, such \\qquad can be seen and heard everywhere in our country. Some administrative departments fail to perform their duties effectively and fairly; some manufacturers fail to turn out products of good quality; some commercial enterprises fail to provide genuine commodities. Can you find anything \\qquad other than their obligations, duties and jobs in these so called activities? I guess your answer will be negative. As a matter of fact, their intention to \\qquad is nothing but to put on civilized outer clothing to please or deceive the public. \\qquadI hold that our society is suffering \\qquad which is exerting harmful influence on society both materially and morally. But \\qquad should know that by dishonest behaviors no one can survive the intense competition under market economy system. They should remember the old saying, “Honesty is the best policy.” 社会公德类：爱心/社会公德 \\qquadWhen we use the word “\\qquad”, we do not simply mean \\qquad , which is a very narrow definition of the word. The picture below illustrates the real meaning of \\qquad, by stressing the fact that \\qquad is emotional strength, which can support us no matter how dark the world around us becomes. As a matter of fact, throughtout history people of many different cultures have regarded \\qquad as the most sublime of human emotions. \\qquadTake an example to illustrate the power of \\qquad . We should remember how the Chinese people of all ethnic groups responded to the call to help the victims of the deadly earthquake in Sichuan Province in 2008. Although their incomes were still low by international standards, people all over the country did not hesitate to donate whatever they could——be it money or goods——to help their needy fellow citizens. Furthermore, they did this with no thought of gain or reward. \\qquadIt is my view that the best way to \\qquad is to help people who are more unfortunate than we are. We should always be ready to give a helping hand to those who are in trouble, no matter whether they are family members or complete strangers. Only by doing so can we help to make the world a better place, for, as the picture shows, the darker the shadows of sorrow become, the more brightly the lamp of \\qquad shines. 教育文化类：教育 \\qquadIt is subtly revealed in the portrayal that \\qquad . Obviously, \\qquad. We are informed that \\qquad. \\qquadSome drving factors that contribute to above-mentioned changes may be summarized as follows. First and foremost, China has become particularly active in \\qquad , which leads to the increasing demand of qualified \\qquad. In addition, the development of job market on the whole cannot keep pace with the expansion of college graduates, which obliges a large number of students to stay on campus for another two or three years to get better prepared for their career. Last but not least, working pressure is another reason. Taking all these factors into account, we may predict that with the speedy development of our society, the number of recruitment of \\qquad will keep growing in the forthcoming decade. \\qquadOn the other side of coin, however, this tendencey may bring about a good many problems, such as the waste of talent. It is necessary for us to take effective measures to ensure this situation won’t get out of hand, and encourage students to develop practical skills while learning theoretical knowledge, since both of them are the demands of the employers. 教育文化类：文化交流/传统文化 \\qquadThe above picture vividly depicts \\qquad. Undoubtedly, \\qquad. The caption indicates that \\qquad. \\qquadWhat the picture conveys goes far beyond only/merely a \\qquad. Instead, it carries cultural meanings/implications as well. The fact that people from different countries are attracted to the mysterious Chinese culture indictates that to some extent a culture can be accepted, respected, appreciated and shared internationally. In other words, a nation’s unique/distinctive culture can become international through worldwide economic and cultural exchanges. Since the trend of globalization is irresistible, the increasing cultural exchanges can effectively imporve mutual understanding and friendship. \\qquadIt is my view that national culture as priceless spiritual treasure should be preserved and cherished. Meanwhile, there are good reasons to advocate international culture because those ideas from other cultures, though controversial or even absurd at first sight, can provide a different perspective for us to observe the world in the long run. Nevertheless, when we are confronted with a different culture, we should be sensible enough to absorb its essence and to resist its dark side. Only in this way can we promote cultural development positively and make our world multidimensional, colorful and vigorous.[充满活力的] 环境保护类 \\qquadAs is subtly portrayed in the cartoon, \\qquad. Unfortunately, \\qquad. And below the drawing, there is a topic which says: \\qquad. \\qquadFrom the portrayal, we can conclude that the painter wants to convey such a message: \\qquad. On the one hand, \\qquad, as a multibillion-dollar business, \\qquad is booming everywhere. Some people, laboring under the belief that \\qquad serves as an engine of economic growth, seem to ignore its negative effects on the environment. Nevertheless, these are not concerns that we can shrug off[摆脱] lightly. On the other hand, \\qquad has exerted great pressure on the environment we are living in: water is polluted, the ecological system is disturbed, and natural resources have been exvessively used. \\qquadUndoubtedly, \\qquad could not be banned in any country as it does help to shore up the economy in places which have few sources of income. However, the significant point is that the unchecked growth of \\qquad may render the development of an economy unsustainable. It is high time that we enhanced people’s awareness to rectify this by taking the environmental protectionn into consideration. 人生哲理框架一 \\qquadThe exaggerative and impressive portrayal has subtly revealed the duality of the relationship between adolescents and society. What the picture conveys goes far beyond merely an ironic cartoon. It carries social meannings as well. \\qquadThe drawing does reflect a thought-provoking social phenomenon that is not uncommon in China nowadays. Superficially, it seems somewhat reasonable, but when weighing in the mind, we find there is an apparent tendency behind this phenomenon: \\qquad. Careful deliberation of this problem has given me several fundamental factors as to why this should be so. Inexperienced and gullible young people plunge into the illusory world of electronic games, online chats oor even pornography. Numerous illustrations can be given, but this will suffice. Looking at this, how can we stay aloof? \\qquadIt is my view that, first of all, the whole society should attach utmost significance to the sound growth of the juvenile. In addition, proper guidance and protection of adults and schools are vital to adolescents. Since neither of the suggestions can effectively solve the problem, there is an increased awareness that the two solutions can be combined with other possible solutions to produce the best effect. Generally speaking, if we exert every effort, it will undoubtedly be brought down and effectively controlled. 人生哲理框架二 \\qquadAs is symbolically illustrated in the cartoon, \\qquad. The caption indicates that \\qquad. \\qquadUndoubtedly, we can deduce from the portrayal that the cartoonist is trying to attract our attention to the issue of \\qquad. According to a survey conducted among a group of people who were in the same college class 10 years ago, those who were ready to \\qquad all becam rich or attained managerial status in various fields, while no a single young man who \\qquad became an executive or a boss. Why do those who are excellent in \\qquad tend to be managers or run their own enterprise later in life? The answer seems self-evident. On the one hand, if you are competent in profession, bu \\qquad, you can hardly survive corporate life. On the other hand, your chances of success are much higher if \\qquad. \\qquadIt is my view that, first and foremost, we can frequently use the drawing to aid juveniles in learning to \\qquad. Futhermore, whatever difficulties or situations we are confronted with, we can remind ourselves that those who have the spirit of \\qquad are nearer to success. &lt;&lt;&lt;&lt;&lt;&lt;&lt; HEAD ======= c44c5145c2e1eb055e30e63105b936dfab46e026 图表作文框架 \\qquadAs is illustrated in the chart/diagram/graph/table, the number of \\qquad is roughly/approximately \\qquad in \\qquad. Obviously/Apparently, the number of \\qquad has been a dramatic rise/decrease over the past few years. \\qquadwhat accounts for the change/differences? From my perspective, at least three factors contribute to it. To begin with, the change is closely related to the rising income of Chinese people. More importantly, the change has a lot to do with the turning of people’s attitude and outlook on life. Last but not least, the change is enhanced and promoted by the government’s better policies as well as the more convenient channels in the \\qquad field. \\qquadAs society further develops, the rising/declining trend is bound to continue for a couple of years in the near/forthcoming future. As far as I am concerned, it is a positive/negative trend and should be stimulated/controlled, since it is beneficial not merely to individuals but to the whole society.","categories":[],"tags":[]},{"title":"merge two sorted lists","slug":"merge two sorted lists","date":"2020-12-14T14:16:42.000Z","updated":"2020-12-15T07:02:07.000Z","comments":true,"path":"2020/12/14/merge two sorted lists/","link":"","permalink":"https://jarvie-mei.github.io/2020/12/14/merge%20two%20sorted%20lists/","excerpt":"","text":"merged two sorted lists 1234567891011121314151617class Solution &#123;public: ListNode* mergeTwoLists(ListNode* l1, ListNode* l2) &#123; if (l1 == nullptr) &#123; return l2; &#125; if (l2 == nullptr) &#123; return l1; &#125; if(l1 -&gt; val &lt;= l2-&gt;val) &#123; l1-&gt;next = mergeTwoLists(l1-&gt;next, l2); return l1; &#125; l2-&gt;next = mergeTwoLists(l1, l2-&gt;next); return l2; &#125;&#125;;","categories":[{"name":"leetcode","slug":"leetcode","permalink":"https://jarvie-mei.github.io/categories/leetcode/"}],"tags":[{"name":"algorithm","slug":"algorithm","permalink":"https://jarvie-mei.github.io/tags/algorithm/"}],"author":"Jarvis"},{"title":"关于贷款中的利率，费率的关系的数学证明","slug":"interset rates","date":"2020-12-13T14:16:22.000Z","updated":"2020-12-14T07:01:53.000Z","comments":true,"path":"2020/12/13/interset rates/","link":"","permalink":"https://jarvie-mei.github.io/2020/12/13/interset%20rates/","excerpt":"","text":"利率与费率的转换","categories":[{"name":"economics","slug":"economics","permalink":"https://jarvie-mei.github.io/categories/economics/"}],"tags":[{"name":"math","slug":"math","permalink":"https://jarvie-mei.github.io/tags/math/"},{"name":"economics","slug":"economics","permalink":"https://jarvie-mei.github.io/tags/economics/"},{"name":"Daily Living Skills","slug":"Daily-Living-Skills","permalink":"https://jarvie-mei.github.io/tags/Daily-Living-Skills/"}]},{"title":"github pictures hosting","slug":"testing github pictures hosting","date":"2020-12-12T14:17:09.000Z","updated":"2020-12-13T07:02:30.000Z","comments":true,"path":"2020/12/12/testing github pictures hosting/","link":"","permalink":"https://jarvie-mei.github.io/2020/12/12/testing%20github%20pictures%20hosting/","excerpt":"","text":"","categories":[],"tags":[]},{"title":"cool post","slug":"featured image support","date":"2020-12-12T14:15:53.000Z","updated":"2020-12-13T07:01:22.000Z","comments":true,"path":"2020/12/12/featured image support/","link":"","permalink":"https://jarvie-mei.github.io/2020/12/12/featured%20image%20support/","excerpt":"","text":"","categories":[],"tags":[]},{"title":"notes for bandit","slug":"notes for banidt","date":"2020-12-11T14:16:57.000Z","updated":"2020-12-13T07:02:18.000Z","comments":true,"path":"2020/12/11/notes for banidt/","link":"","permalink":"https://jarvie-mei.github.io/2020/12/11/notes%20for%20banidt/","excerpt":"","text":"wargame bandit redirect STDERR to STDOUT and saved the messages to a file. 1ls -l video.mpg blah.foo &gt; myoutput 2&gt;&amp;1 I often find people try and write their pipes all out in one go and make a mistake somewhere along the line. They then think it is in one point but in fact it is another point. They waste a lot of time trying to fix a problem that is not there while not seeing the problem that is there. If you build your pipes up incrementally then you won’t fall into this trap. Run the first program and make sure it provides the output you were expecting. Then add the second program and check again before adding the third and so on. This will save you a lot of frustration. bandtt8: cvX2JJa4CFALtqS87jk27qwqGhBM9plV bandit9: UsvVyFSfZZWbi6wgC7dAFyFuR6jQQUhR bandit11: IFukwKGsFW8MOq3IRFqrxE1hxTNEbUPR bandit13: 8ZjyCRiBWFYkneahHwxCv3wb2a1ORpYL bandit14: 4wcYUJFw0k0XLShlDzztnTBHiqxU3b3e bandit17: xLYVMN9WE5zQ5vHacb0sZEVqbrp7nBTn Bandit19: IueksS7Ubh8G3DCwVzrTd8rAVOwq3M5x Bandit20: GbKksEFF4yrVs6il55v6gwY5aVje5f0j Bandit21:gE269g2h3mw3pwgrj0Ha9Uoqen1c9DGr echo … | nc -l -port … Bandit22: Yk7owGAcWjwMVRwrTesJEwB7WVOiILLI Bandit23: jc1udXuA1tiHqjIsL8yaapX5XIAI6i0n Bandit24: UoMYTrfrBFHyQXmg6gzctqAwOmw1IohZ bandit24 write up so fucking hard password for bandit25 is : uNG9O58gUE7snukf3bvZ0rxhtnjzSGzG bandit26 writeup 12$ echo &#x27;cat /etc/bandit_pass/bandit27&#x27; &gt; script.sh$ ./bandit27-do script.sh bandit27: uNG9O58gUE7snukf3bvZ0rxhtnjzSGzG","categories":[{"name":"bandit","slug":"bandit","permalink":"https://jarvie-mei.github.io/categories/bandit/"}],"tags":[{"name":"bandit","slug":"bandit","permalink":"https://jarvie-mei.github.io/tags/bandit/"},{"name":"cybersecurity","slug":"cybersecurity","permalink":"https://jarvie-mei.github.io/tags/cybersecurity/"}],"author":"Jarvis"},{"title":"diary","slug":"20201212","date":"2020-12-11T14:14:53.000Z","updated":"2020-12-11T07:01:07.000Z","comments":true,"path":"2020/12/11/20201212/","link":"","permalink":"https://jarvie-mei.github.io/2020/12/11/20201212/","excerpt":"Here's something encrypted, password is required to continue reading.","text":"Hey, password is required here.85956e01efb01a5ef99a41a71a2253a18728ba8058b25a28041497a799923d883aa9853e5d61cd9b1304d222c58f6faa91c1280083c91bdb59f082e4da3719303cc61eaf1f48f5b7d6df72c80d73f80504b9a4a876d29f0bee79b34adc3790552420c7247b74bd89ff9236752a543cde01b3f60ce055d067c6bc4e1174259845ea820ddbd8657fa2eaafb3fd4cccd9ad","categories":[{"name":"diary","slug":"diary","permalink":"https://jarvie-mei.github.io/categories/diary/"}],"tags":[{"name":"encryptedDiaries","slug":"encryptedDiaries","permalink":"https://jarvie-mei.github.io/tags/encryptedDiaries/"}]},{"title":"Hello World","slug":"hello-world","date":"2020-12-10T14:16:10.000Z","updated":"2020-12-12T07:01:41.000Z","comments":true,"path":"2020/12/10/hello-world/","link":"","permalink":"https://jarvie-mei.github.io/2020/12/10/hello-world/","excerpt":"","text":"Welcome to Hexo! This is your very first post. Check documentation for more info. If you get any problems when using Hexo, you can find the answer in troubleshooting or you can ask me on GitHub. Quick Start Create a new post 1$ hexo new &quot;My New Post&quot; More info: Writing Run server 1$ hexo server More info: Server Generate static files 1$ hexo generate More info: Generating Deploy to remote sites 1$ hexo deploy More info: Deployment Embedded a youtube video 1&#123;% youtube lJIrF4YjHfQ %&#125;","categories":[],"tags":[]}],"categories":[{"name":"leetcode","slug":"leetcode","permalink":"https://jarvie-mei.github.io/categories/leetcode/"},{"name":"economics","slug":"economics","permalink":"https://jarvie-mei.github.io/categories/economics/"},{"name":"bandit","slug":"bandit","permalink":"https://jarvie-mei.github.io/categories/bandit/"},{"name":"diary","slug":"diary","permalink":"https://jarvie-mei.github.io/categories/diary/"}],"tags":[{"name":"algorithm","slug":"algorithm","permalink":"https://jarvie-mei.github.io/tags/algorithm/"},{"name":"math","slug":"math","permalink":"https://jarvie-mei.github.io/tags/math/"},{"name":"economics","slug":"economics","permalink":"https://jarvie-mei.github.io/tags/economics/"},{"name":"Daily Living Skills","slug":"Daily-Living-Skills","permalink":"https://jarvie-mei.github.io/tags/Daily-Living-Skills/"},{"name":"bandit","slug":"bandit","permalink":"https://jarvie-mei.github.io/tags/bandit/"},{"name":"cybersecurity","slug":"cybersecurity","permalink":"https://jarvie-mei.github.io/tags/cybersecurity/"},{"name":"encryptedDiaries","slug":"encryptedDiaries","permalink":"https://jarvie-mei.github.io/tags/encryptedDiaries/"}]}